# Adding Columns

In [ ]:
import pandas as pd 

data = {
    "name" : ["ram","shyam","ghanshyam","dhanshyam","aditi","jagdish","raj","simran"],
    "age" :[28,34,22,30,29,40,25,32],
    "salary" :[50000,60000,45000,52000,40000,70000,40000,50000],
    "performance_score" :[85,90,78,92,88,95,80,89]
}

df = pd.DataFrame(data)
df['bonus'] = df['salary']*0.1  #  simple method add column at the last 
df

        name  age  salary  performance_score   bonus
0        ram   28   50000                 85  5000.0
1      shyam   34   60000                 90  6000.0
2  ghanshyam   22   45000                 78  4500.0
3  dhanshyam   30   52000                 92  5200.0
4      aditi   29   40000                 88  4000.0
5    jagdish   40   70000                 95  7000.0
6        raj   25   40000                 80  4000.0
7     simran   32   50000                 89  5000.0